# დავალება:
# ქვემოთ მოცემული კოდი უნდა აბრუნებდეს რიცხვის ციფრთა ჯამს, მაგრამ შეცდომაა.

# წაიკითხე კოდი.*
# იპოვე შეცდომა(ები).
# გაასწორე და სწორად დაწერე.
# def sum_digits(n):
#     result = 0
#     while n > 0:
#         result += n % 10
#         n // 10
#     return result

# print(sum_digits(123))  # მოსალოდნელი შედეგი: 6 (1 + 2 + 3)
# print(sum_digits(405))  # მოსალოდნელი შედეგი: 9 (4 + 0 + 5)
# დამატებითი კითხვები:
# ✅ კოდის გაშვების გარეშე შეგიძლია იპოვო შეცდომა?
# ✅ როგორ შეიძლება კოდი ისე შეცვალო, რომ უარყოფითი რიცხვებიც იმუშაოს სწორად?


def sum_digits(n):
    sum = 0
    for i in str(n):
        sum += int(i)
    return sum
print(sum_digits(123))
print(sum_digits(405))













