// JavaScript-ში კლასი ჰგავს ობიექტების შექმნის template - ს. ის განსაზღვრავს თვისებებს და ქცევებს, რომლებიც ექნებათ შექმნილ ობიექტებს.

// ძირითადი ფუნქტები:
// კონსტრუქტორი: კონსტრუქტორი არის სპეციალური ფუნქცია კლასში, რომელიც გამოიყენება ახალი ობიექტების დასაყენებლად.
// მეთოდები: კლასში არის განსაზღვრული ფუნქციები, რომლებიც აღწერენ რისი გაკეთება შეუძლია ობიექტს.


// აი 2 მაგალითი კლასებზე


// მაგალითი 1

class Car {
    constructor(brand) {
        this.brand = brand; // შემოგვაქვს ბრენდი
    }

    drive() { // ეს არის მეთოდი
        console.log(`${this.brand} is driving.`);
    }
}

const myCar = new Car('Toyota'); // ვქმნით კონსტანტას სახელით myCar რომელიც უდრის new Car("აქ ვწერთ ბრენდს")
myCar.drive(); // პასუხი: Toyota is driving.



// მაგალითი 2


class Color {
    constructor(name) {
        this.name = name; // აქაც შემოგვაქვს სახელი
    }

    display() { // ესეც არის მეთოდი
        console.log(`The color is ${this.name}.`); // აქ ვიყენებთ სტრინგ ლიტერალს რომ ადვილად გამოვიტანოთ პასუხი, ეს მეთოდი ასევე გვაქვს გამოყენებული ზედა მაგალითში
    }
}

const myColor = new Color('blue');  // აქაც ვქმნით კონსტანტას სახელად myColor რომელიც უდრის ჩვენს მიერ ჩაწერილ ფერს new Color("აქ ჩაიწერება ფერი") 
myColor.display(); // პასუხი: The color is blue.
